---
layout: page
title: Gestão do Conhecimento
date: 2009-05-17 17:01:45.000000000 +00:00
type: page
parent_id: '580'
published: true
password: ''
status: publish
categories: []
tags: []
meta:
  _publicize_pending: '1'
  _import_session_id: 5f47b4106fdc1
  _import_original_post_id: '582'
author:
  login: brunotadeurusso
  email: brusso@gmail.com
  display_name: BrunoRusso
  first_name: Bruno
  last_name: Russo
permalink: "/mba/gestao-do-conhecimento/"
---
<blockquote>A Gest&#227;o do conhecimento possui objetiva controlar, facilitar o acesso e manter um gerenciamento integrado sobre as informaç&#245;es em seus diversos meios. Entende-se por conhecimento a informaç&#227;o interpretada, ou seja, o que cada informaç&#227;o significa e que impactos no meio cada informaç&#227;o pode causar, de modo que a informaç&#227;o possa ser utilizada para importantes aç&#245;es e tomadas de decis&#245;es. [<a title="wikipédia" href="http://pt.wikipedia.org/wiki/Gest%C3%A3o_do_conhecimento">wikipédia</a>]</p></blockquote>
<p style="text-align:left;"><a href="http://pt.wikipedia.org/wiki/Gest%C3%A3o_do_conhecimento"><img class="aligncenter" src="{{ site.baseurl }}/assets/2009/05/Conhecimento-Diagrama.png" alt="Conhecimento Diagrama" width="360" height="298" /></a></p>
<p style="text-align:left;">
<p style="text-align:left;"><strong><span style="text-decoration:underline;">Alguns tópicos sobre gest&#227;o do conhecimento</span></strong></p>
<ol>
<li>A Gest&#227;o do Conhecimento custa caro, a ignorância é caríssima;</li>
<li>A Gest&#227;o do Conhecimento efetiva requer soluç&#245;es que combinem pessoas e tecnologia;</li>
<li>Gest&#227;o do Conhecimento, é altamente política;</li>
<li>Gest&#227;o do Conhecimento requer gestores do conhecimento;</li>
<li>Gest&#227;o do Conhecimento se beneficia mais de mapas do que de modelos mais de mercados do que de hierarquias;</li>
<li>O compartilhamento e uso do conhecimento s&#227;o comportamentos antinaturais;</li>
<li>Gest&#227;o do Conhecimento significa arrumar os processos de trabalho relacionados com o conhecimento;</li>
<li>O acesso ao conhecimento é apenas único;</li>
<li>Gest&#227;o do Conhecimento nunca tem fim;</li>
<li>Gest&#227;o do Conhecimento requer um contrato de conhecimento.</li>
</ol>
<p><span style="color:#0000ff;"><strong><span style="text-decoration:underline;">Princípios gerais da Gest&#227;o do Conhecimento</span></strong></span></p>
<ol>
<li>A Gest&#227;o do Conhecimento tem origem e reside na cabeça das pessoas;</li>
<li>O compartilhamento da Gest&#227;o do Conhecimento exige confiança;</li>
<li>A tecnologia possibilita novos comportamentos ligados &#224; Gest&#227;o do Conhecimento;</li>
<li>O compartilhamento da Gest&#227;o do Conhecimento deve ser estimulado e recompensado;</li>
<li>Apoio da direç&#227;o e recursos s&#227;o essenciais;</li>
<li>Iniciativas da Gest&#227;o do Conhecimento devem começar por um programa piloto;</li>
<li>Aferiç&#245;es quantitativas s&#227;o necessárias para avaliar a iniciativa;</li>
<li>O conhecimento é criativo e deve ser estimulado a se desenvolver de forma incentivada.</li>
</ol>
<p><span style="color:#ff0000;"><span style="text-decoration:underline;"><strong>Onze pecados capitais da gest&#227;o do conhecimento</strong></span></span></p>
<ol>
<li>Nenhuma definiç&#227;o organizacional do conhecimento;</li>
<li>&#202;nfase no estoque do conhecimento em detrimento do fluxo do conhecimento;</li>
<li>Reconhecer o conhecimento como predominantemente fora da cabeça das pessoas;</li>
<li>N&#227;o criar contexto compartilhado;</li>
<li>Desconsiderar o papel do conhecimento tácito;</li>
<li>Desconsiderar a Gest&#227;o do Conhecimento dos seus usuários;</li>
<li>Diminuir/desconsiderar a importância relativa do pensamento e da argumentaç&#227;o;</li>
<li>Priorizar ou focar no passado/presente e n&#227;o o futuro;</li>
<li>N&#227;o reconhecer a importância da experi&#234;ncia (tentativaXerro);</li>
<li>Substituir o contato humano pelo contato tecnológico;</li>
<li>Buscar desenvolver o conhecimento sem base organizacional.</li>
</ol>
