---
layout: post
title: Tampão de gasolina do FIAT Pálio não funciona como deveria funcionar
date: 2006-03-03 15:39:05.000000000 +00:00
type: post
parent_id: '0'
published: true
password: ''
status: publish
categories:
- blog
tags: []
meta:
  _publicize_pending: '1'
  _import_session_id: 5f47b4106fdc1
  _import_original_post_id: '73'
permalink: "/2006/03/03/tampao-de-gasolina-do-fiat-palio-nao-funciona-como-deveria-funcionar/"
---
<p>No último, 01/03/2006, por volta das 18:00hs parei para abastecer o veículo e para surpresa minha descobri depois de tentar muito, que o tamp&atilde;o de gasolina do carro Palio ano/modelo 99/99 (FIAT), n&atilde;o abria. <br />Foi quando o frentista me falou:<br />- Esses carros s&atilde;o todos iguais, o tamp&atilde;o de gasolina é sempre difícil de abrir.<br />Em seguida me dirigi a outro posto de gasolina, para verificar se podiam fazer algo. Nesse posto novas tentativas fracassadas, para abrir o tamp&atilde;o. Como os procedimentos n&atilde;o surtiram efeito, fui &agrave; minha casa peguei a chave reserva e tentei novamente e novamente sem resultado. <br />Como precisava abastecer o veículo, pois a luz que indica que o combustível está na reserva estava acesa, resolvi ir a um chaveiro mais próximo para tentar resolver o problema.<br />Assim que cheguei ao chaveiro, solicitei auxílio para abrir o tamp&atilde;o de gasolina, quando para minha surpresa o mesmo indagou.<br />- Qual é o carro. Pálio?<br />Surpreso com sua pergunta, respondi que era um FIAT pálio.<br />No caminho até o veículo o chaveiro informou que esse problema (transtorno) é algo corriqueiro, ele recebe diversas pessoas com o mesmo problema várias vezes no m&ecirc;s e ainda completou.<br />- Esse tamp&atilde;o n&atilde;o foi a melhor coisa que a FIAT fez, talvez seja por isso que esse os novos modelos possuem outro modelo de tamp&atilde;o.<br />O resultado do chaveiro foi:<br />- Um novo tamp&atilde;o (que por sinal é branco, diferente da cor do veículo);<br />- R$ 100,00 a menos na conta (foi o valor do concerto.)<br />- Cerca de 3 horas gastas para abastecer o veículo.<br />O engra&ccedil;ado que quando comprei esse veículo de uma concessionária FIAT, n&atilde;o fui alertado sobre problemas na tampa do tanque de combustível. Muito menos se deveria tomar algum cuidado, como por exemplo lubrificar de tempos em tempos o miolo da fechadura etc.<br />Tentei entrar em contato pelo 0800, mas o que disseram foi, realmente ilário: <br />- Sr. o problema já foi resolvido, ent&atilde;o a FIAT n&atilde;o pode fazer mais nada.<br />É melhor rir do que chorar, escutar uma atendente de uma multinacional dizer isso, para um problema que é relatado por diversos frentistas e diversos chaveiros.<br />Informe que necessito de uma resposta rápida, para esse problema ocorrido, visto que o carro é azul e o tamp&atilde;o de gasolina está branco.<br />N&atilde;o gostaria de acreditar que &agrave;quelas frases antigas:<br />- FIAT -&gt; Família Italiana atrapalhando o tr&acirc;nsito<br />- FIAT -&gt; Fui inganado agora é tarde<br />fossem verdades!</p>
