---
layout: post
title: Percepção do Tempo pelo Cérebro
date: 2006-01-23 22:44:48.000000000 +00:00
type: post
parent_id: '0'
published: true
password: ''
status: publish
categories:
- blog
tags: []
meta:
  _publicize_pending: '1'
  _import_session_id: 5f47b4106fdc1
  _import_original_post_id: '62'
permalink: "/2006/01/23/percepcao-do-tempo-pelo-cerebro/"
---
<p>O texto a seguir recebi por e-mail. É muuuuuuuuuuuuito&nbsp; longo, mas vale a pena ler!</p>
<p> O cérebro humano mede o tempo por meio da observa&ccedil;&atilde;o dos movimentos. Se alguém colocar voc&ecirc; dentro de uma sala branca vazia, sem nenhuma mobília, sem portas ou janelas, sem relógio, voc&ecirc; come&ccedil;ará a perder a no&ccedil;&atilde;o do tempo. Por alguns dias, sua mente detectará a passagem do tempo sentindo rea&ccedil;&otilde;es internas do seu corpo, incluindo os batimentos cardíacos, ciclos e sono, fome, sede e press&atilde;o sanguínea. Ent&atilde;o quando tempo suficiente houver passado, voc&ecirc; perderá completamente a no&ccedil;&atilde;o das horas, dos dias...ou anos. Isso acontece porque nossa no&ccedil;&atilde;o de passagem do tempo deriva do movimento dos objetos, pessoas, sinais naturais e da repeti&ccedil;&atilde;o de eventos cíclicos, como o nascer e o p&ocirc;r do sol. Se alguém tirar estes sinais sensoriais da nossa vida, simplesmente perdemos a no&ccedil;&atilde;o da passagem do tempo. Compreendido este ponto, há outra coisa que voc&ecirc; tem que considerar:</p>
<ul>
<li> nosso cérebro é extremamente otimizado. Ele evita fazer duas vezes o mesmo trabalho.</li>
</ul>
<p> Um adulto médio tem entre 40 e 60 mil pensamentos por dia. Qualquer&nbsp; um de nós ficaria louco se o cérebro tivesse que processar conscientemente tal quantidade. Por isso, a maior parte destes pensamentos é automatizada e n&atilde;o aparece no índice de eventos do dia. Para que n&atilde;o fiquemos loucos, o cérebro faz parecer que nós n&atilde;o vimos, n&atilde;o sentimos e n&atilde;o vivenciamos aqueles pensamentos automáticos, repetidos, iguais. </p>
<p>Por isso, quando voc&ecirc; vive uma experi&ecirc;ncia pela primeira vez, ele dedica muitos recursos para compreender o que está acontecendo. É quando voc&ecirc; se sente mais vivo. Conforme a mesma experi&ecirc;ncia vai se repetindo, ele vai simplesmente colocando suas rea&ccedil;&otilde;es no modo automático e &quot;apagando&quot; as experi&ecirc;ncias duplicadas. Se voc&ecirc; entendeu estes dois pontos, já vai compreender porque parece que o tempo acelera, quando ficamos mais velhos e porque os natais chegam cada vez mais rapidamente. </p>
<p>Quando come&ccedil;amos a dirigir, tudo parece muito complicado, o c&acirc;mbio, os espelhos, os outros veículos, nossa aten&ccedil;&atilde;o parece ser requisitada ao máximo. Ent&atilde;o, um dia dirigimos trocando de marcha, olhando os semáforos, lendo os sinais ou até falando ao celular (proibido no Brasil), ao mesmo tempo. E voc&ecirc; usa apenas uma pequena &quot;área&quot; da aten&ccedil;&atilde;o para isso. Como acontece?</p>
<p></p>
<ul>
<li> Simples: o cérebro já sabe o que está escrito nas placas (voc&ecirc; n&atilde;o l&ecirc; com os olhos, mas com a imagem anterior, na mente);</li>
<li>O cérebro já sabe qual marcha trocar (ele simplesmente pega suas experi&ecirc;ncias passadas e usa, no lugar de repetir realmente a experi&ecirc;ncia).   </li>
</ul>
<p> Em outras palavras, voc&ecirc; n&atilde;o vivenciou aquela experi&ecirc;ncia, pelo menos para a mente. Aqueles críticos segundos de troca de marcha, leitura de placas, s&atilde;o apagados de sua no&ccedil;&atilde;o de passagem do tempo...</p>
<p> Que rela&ccedil;&atilde;o tem isso com a aparente acelera&ccedil;&atilde;o do tempo?</p>
<p> Tudo. A primeira vez que isso me ocorreu foi quando passei tr&ecirc;s meses nas florestas de New Hampshire, Estados Unidos, morando em uma cabana. Era tudo t&atilde;o diferente, as pessoas, a paisagem, a língua, que eu tinha dores de cabe&ccedil;a sempre que viajava em uma estrada, porque meu cérebro ficava lendo todas as placas (eu lia mesmo, pois era tudo novidade, para mim). Foram somente tr&ecirc;s meses, mas ao final do segundo m&ecirc;s eu já me sentia como se estivesse há um ano longe do Brasil. Foi quando comecei a pesquisar a raz&atilde;o dessa diferen&ccedil;a de percep&ccedil;&atilde;o.Bastou eu voltar ao Brasil e o tempo voltou a &quot;acelerar&quot;. Pelo menos, assim parecia. </p>
<p>Veja, quando voc&ecirc; come&ccedil;a a repetir algo exatamente igual, a mente apaga a experi&ecirc;ncia repetida. Conforme envelhecemos, as coisas come&ccedil;am a se repetir as mesmas ruas, pessoas, problemas, desafios, programas de televis&atilde;o, reclama&ccedil;&otilde;es. Enfim, as experi&ecirc;ncias novas (aquelas que fazem a mente parar e pensar de verdade, fazendo com que seu dia pare&ccedil;a ter sido longo e cheio de novidades), v&atilde;o diminuindo. Até que tanta coisa se repete que fica difícil dizer o que tivemos de novidade na semana, no ano ou, para algumas pessoas, na década. </p>
<p> Em outras palavras, o que faz o tempo parecer que acelera é a <strong>r-o-t-i-n-a.</strong> N&atilde;o me entenda mal. A rotina é essencial para a vida e otimiza muita coisa, mas a maioria das pessoas ama tanto a rotina que, ao longo da vida, seu diário acaba sendo um livro de um só capítulo, repetido todos os anos. </p>
<p><u><strong> O ANTÍDOTO PARA A ACELERA&Ccedil;&Atilde;O DO TEMPO </strong></u></p>
<p> Felizmente há um antídoto: Mude e Marque. </p>
<p>Mude, fazendo algo diferente e marque, fazendo um ritual, uma festa ou registros com fotos. </p>
<p>Mude de paisagem, tire férias com a família (sugiro que voc&ecirc; tire férias sempre e, preferencialmente, para um lugar quente, um ano, e frio no seguinte) e marque com fotos, cart&otilde;es postais e cartas. Tenha filhos (eles destroem a rotina) e sempre fa&ccedil;a festas de aniversário para eles, e para voc&ecirc; (marcando o evento e diferenciando o dia).</p>
<p>Use e abuse dos rituais para tornar momentos especiais diferentes de momentos usuais.</p>
<p>Fa&ccedil;a festas de noivado, casamento, 15 anos, bodas disso ou daquilo, bota-foras, participe da formatura de sua turma, visite parentes distantes, vá a uma final de campeonato, entre na universidade com 60 anos. </p>
<p>Troque a cor do cabelo, deixe a barba, tire a barba, compre enfeites diferentes no natal, ou fa&ccedil;a os enfeites com frutas da regi&atilde;o e a participa&ccedil;&atilde;o das crian&ccedil;as, vá a shows, cozinhe uma receita nova, tirada de um livro novo. </p>
<p>Escolha roupas diferentes, n&atilde;o pinte a casa da mesma cor, fa&ccedil;a diferente. </p>
<p>Beije diferente sua paix&atilde;o e viva com ela momentos diferentes. </p>
<p>Vá a mercados diferentes, leia livros diferentes, busque experi&ecirc;ncias diferentes. </p>
<p>Seja diferente. Se voc&ecirc; tiver dinheiro, especialmente se já estiver aposentado, vá com seu marido, esposa ou amigos para outras cidade ou países, veja outras culturas, visite museus estranhos, deguste pratos esquisitos.</p>
<p>Em outras palavras <strong>v-i-v-a</strong>, porque se voc&ecirc; viver intensamente as diferen&ccedil;as, o tempo vai parecer mais longo.</p>
<p> E se tiver a sorte de estar casado (a) com alguém disposto (a) viver e buscar coisas diferentes, seu livro será muito mais longo, muito mais interessante e muito mais vivo do que a maioria dos livros da vida que existem por ai. </p>
<p>Se voc&ecirc; n&atilde;o tiver mais a esposa, ou o marido, cerque-se de amigos. Amigos com gostos diferentes, vindos de lugares diferentes, com religi&otilde;es diferentes e que gostam de comidas diferentes.</p>
<p> Enfim, acho que voc&ecirc; já entendeu o recado, n&atilde;o é?</p>
<p> Boa sorte em suas experi&ecirc;ncias para expandir seu tempo, com qualidade, emo&ccedil;&atilde;o, rituais e vida.</p>
<p>&nbsp;</p>
<p align="right"><em>Aldo Novak, coach: conferencista. Diretor da Academia Novak </em> </p>
