---
layout: post
title: Ter vinte e poucos anos...
date: 2006-01-27 23:50:46.000000000 +00:00
type: post
parent_id: '0'
published: true
password: ''
status: publish
categories:
- blog
tags: []
meta:
  _publicize_pending: '1'
  _import_session_id: 5f47b4106fdc1
  _import_original_post_id: '63'
permalink: "/2006/01/27/ter-vinte-e-poucos-anos/"
---
<p>Isto é chamado de <em><strong>&quot;crise de um quarto de vida&quot;</strong></em>.</p>
<p>É quando voc&ecirc; pára de sair com a galera e come&ccedil;a a perceber muitas coisas sobre voc&ecirc; que voc&ecirc; mesmo n&atilde;o conhece e pode n&atilde;o gostar disso.</p>
<p>Voc&ecirc; come&ccedil;a a se sentir inseguro e pensar sobre onde voc&ecirc; vai estar daqui a um ano ou dois, mas de repente se sente inseguro porque voc&ecirc; mal sabe onde está agora. Voc&ecirc; come&ccedil;a a perceber que as pessoas s&atilde;o egoístas e que, talvez, aqueles amigos que voc&ecirc; pensou que eram t&atilde;o próximos n&atilde;o s&atilde;o exatamente as melhores pessoas que voc&ecirc; encontrou em seu caminho, e pessoas que voc&ecirc; perdeu o contato eram algumas das mais importantes. O que voc&ecirc; n&atilde;o consegue perceber é que eles percebem isso também, e n&atilde;o est&atilde;o sendo frios, grosseiros, ou falsos, mas est&atilde;o t&atilde;o confusos quanto voc&ecirc;.</p>
<p>Voc&ecirc; olha para seu emprego...e n&atilde;o é nem perto do que voc&ecirc; imaginava que estaria fazendo, ou talvez voc&ecirc; esteja procurando emprego e percebendo que vai come&ccedil;ar do zero e isso pode te assustar. Suas opini&otilde;es se tornaram mais fortes. Voc&ecirc; v&ecirc; o que os outros est&atilde;o fazendo e se encontra julgando mais do que o usual, porque voc&ecirc; percebe que desenvolveu certo limites na sua vida e está constantemente adicionando coisas na sua lista do que é aceitável e o que n&atilde;o é.</p>
<p>Em um minuto, voc&ecirc; está inseguro e no próximo, seguro.</p>
<p>Voc&ecirc; ri e chora com a maior for&ccedil;a da sua vida. Voc&ecirc; se sente sozinho, assustado e confuso. De repente, a mudan&ccedil;a é sua maior inimiga e voc&ecirc; tenta se agarrar ao passado com a vida boa, mas logo percebe que o passado está cada vez mais longe, e n&atilde;o há nada a se fazer a n&atilde;o ser ficar onde está<br /> ou caminhar para a frente. </p>
<p>Voc&ecirc; tem seu cora&ccedil;&atilde;o quebrado e pensa como alguém que voc&ecirc; amava tanto p&ocirc;de causar tanto estrago em voc&ecirc;. Ou voc&ecirc; fica deitado na cama e pensa por que voc&ecirc; n&atilde;o poderia encontrar alguém decente o suficiente que voc&ecirc; queira conhecer melhor. Ou &agrave;s vezes voc&ecirc; ama alguém e ama outro alguém também e n&atilde;o consegue imaginar porque voc&ecirc; faz isso, já que voc&ecirc; sabe que n&atilde;o é uma má pessoa. Ficar com alguém por uma noite ou galinhar come&ccedil;am a parecer ridículos. Agir como um idiota se torna patético. Voc&ecirc; sente as mesmas coisas e enfrenta as mesmas quest&otilde;es de novo e de novo, e conversa com seus colegas sobre as mesmas coisas porque voc&ecirc; n&atilde;o consegue tomar decis&otilde;es.</p>
<p>Voc&ecirc; se preocupa sobre empréstimos, dinheiro, o futuro e construir sua própria vida...e enquanto ganhar a corrida seria maravilhoso, neste momento voc&ecirc; gostaria apenas de participar! O que voc&ecirc;<br /> pode n&atilde;o perceber é que todos que l&ecirc;em isso encontram algo em comum. <br /> Estamos em uma das melhores e piores épocas da vida, tentando o máximo que podemos acabar com isso.  </p>
<p align="right"><em>autor desconhecido&nbsp;</em></p>
