---
layout: post
title: Quem ri por último, ri melhor!
date: 2006-03-09 09:02:15.000000000 +00:00
type: post
parent_id: '0'
published: true
password: ''
status: publish
categories:
- blog
tags: []
meta:
  _publicize_pending: '1'
  _import_session_id: 5f47b4106fdc1
  _import_original_post_id: '76'
permalink: "/2006/03/09/quem-ri-por-ultimo-ri-melhor/"
---
<p><strong>Carta de mulher p/ marido</strong></p>
<p>Querido,<br />Estou escrevendo esta carta para dizer que vou te deixar para sempre.<br />Fui uma boa mulher para voc&ecirc; durante sete anos e n&atilde;o tenho nada a provar.<br />As duas semanas passadas foram um inferno.<br />O teu chefe me chamou para dizer que tinha te demitido e isto foi a gota d&rsquo;água.<br />Na semana passada, voc&ecirc; chegou em casa e n&atilde;o notou que eu tinha um novo penteado e tinha ido &agrave; manicure.<br />Cozinhei a tua refei&ccedil;&atilde;o preferida e até usei uma nova lingerie.<br />Chegou em casa, comeu em dois minutos e foi dormir depois de ver o jogo.<br />N&atilde;o me digas que me amas, nunca mais fizemos sexo.<br />Ou está me enganando ou ent&atilde;o n&atilde;o me amas mais, seja qual for o caso, vou te deixar.</p>
<p>P.S.: Se quiser me encontrar, desiste. O teu irm&atilde;o e eu vamos viajar para as Bahamas e nos casar!</p>
<p>A tua ex-mulher.</p>
<p>________________________________</p>
<p><strong>Querida ex-mulher,</strong></p>
<p>Nada me fez mais feliz do que ler sua carta.<br />É verdade que estivemos casados durante sete anos, mas dizer que voc&ecirc; foi uma boa mulher, já está exagerando.<br />Vejo futebol para tentar n&atilde;o te ouvir resmungar a toda a hora.<br />Assim n&atilde;o valia a pena.<br />Realmente reparei que tinha um novo penteado na semana passada, e a primeira coisa que me veio &agrave; cabe&ccedil;a foi: &quot;Parece um homem!&quot; Mas minha m&atilde;e sempre me disse para n&atilde;o dizer nada que n&atilde;o fosse bonito.<br />Quando cozinhou a minha refei&ccedil;&atilde;o preferida, voc&ecirc; deve ter confundido com a do meu irm&atilde;o, porque deixei de comer porco há sete anos.<br />Fui dormir porque reparei que a lingerie ainda tinha a etiqueta do pre&ccedil;o. Rezei que fosse uma coincid&ecirc;ncia o meu irm&atilde;o ter me pedido emprestado R$ 50,00 e a lingerie ter custado R$ 49,99.<br />Depois de tudo isto, eu ainda te amava, e senti que podíamos resolver os nossos problemas.<br />Assim quando descobri que eu tinha ganhado na Mega-Sena, deixei o meu emprego e comprei dois bilhetes de avi&atilde;o para a Jamaica.<br />Mas quando cheguei em casa voc&ecirc; já tinha ido...<br />Tudo acontece por alguma raz&atilde;o. Espero que tenha a vida que sempre sonhou.<br />O meu advogado me disse que devido &agrave; carta que escreveu, n&atilde;o terá direito a nada.<br />Portanto, se cuide.</p>
<p>P.S.: N&atilde;o sei se eu alguma vez te disse isto, mas o Carlos, o meu irm&atilde;o, nasceu Carla. Espero que isso n&atilde;o seja um problema.</p>
<p>Assinado:</p>
<p>Milionário e solteiro!!!</p>
<p>&nbsp;</p>
<p align="right"><em>Este é mais um texto recebido por e-mail. Autor: desconhecido!</em>&nbsp;</p>
