---
layout: post
title: Brasil Pode Votar pelo OpenXML na ABNT
date: 2007-08-06 08:24:16.000000000 +00:00
type: post
parent_id: '0'
published: true
password: ''
status: publish
categories:
- blog
tags: []
meta:
  _publicize_pending: '1'
  _import_session_id: 5f47b4106fdc1
  _import_original_post_id: '233'
permalink: "/2007/08/06/brasil-pode-votar-pelo-openxml-na-abnt/"
---
<p><a href="http://www.openxml.info/"></p>
<p style="text-align:center;"><img src="{{ site.baseurl }}/assets/2007/08/banner-ooxmlnaoapto.gif" alt="OXML" border="0" /></p>
<p></a><br />
Conforme e-mail recebido pela <a href="http://www.dicas-l.com.br">Dicas-L</a>, está chegando ao fim a votaç&#227;o pelo formato padr&#227;o de documentos de escritório.<br />
Mas ainda dá tempo para reverter essa situaç&#227;o, que de certa forma é <a href="http://www.openxml.info/index.php?option=com_content&amp;task=category&amp;sectionid=5&amp;id=3&amp;Itemid=9">desfavorável</a>, mas ainda é possível reverter a situaç&#227;o.</p>
<p>Abaixo segue parte do e-mail escrito por ThigU:</p>
<blockquote><p> A ISO (International Organization for Standarization) há um tempo atrás havia<br />
adotado o padr&#227;o ODF (Open Document Format) como padr&#227;o de documentos de escritório. Pois ent&#227;o, a Microsoft, n&#227;o sendo boba e percebendo o mercado que estava em perigo, logo iniciou a criaç&#227;o do padr&#227;o OOXML (Office Open XML), supostamente aberto. Desenvolvedores que analisaram ambos os formatos afirmam que o OOXML é extremamente complexo e incompleto, pois ele n&#227;o especifica a implementaç&#227;o de diversas funç&#245;es, que é claro, ficar&#227;o a cargo apenas<br />
da suíte de escritório da Microsoft implementar. Ou seja, apesar do padr&#227;o aberto, um documento criado em OOXML em uma aplicaç&#227;o necessariamente n&#227;o será aberto em outra aplicaç&#227;o com suporte ao formato.<br />
(...)<br />
E o que isso tudo haver, já que a OSI já adotou o ODF como padr&#227;o?<br />
Bem, a Microsoft realizou um pedido para que incluísse o seu formato também como padr&#227;o de documentos, permitindo que ela force seu padr&#227;o em governos e empresas.</p>
<p>Porém, para que o padr&#227;o seja aceito, é necessário que as instituiç&#245;es de padronizaç&#227;o de diversos países façam seus votos. No Brasil somos representados pela ABNT. Sendo assim, há alguns meses tem ocorrido diversas reuni&#245;es de empresas com o propósito de discutir o melhor padr&#227;o, e que qual deles será levado para votaç&#227;o na ISO. Para participar, basta que alguém, representando uma empresa, seja ela pública ou particular, compareça pelo menos 30% das reuni&#245;es, sendo que existem apenas mais duas reuni&#245;es, uma dia 9 de agosto, no Rio de Janeiro, e outra dia 23 de agosto, provavelmente em Brasília.</p>
<p>No entanto, segundo boatos (http://www.softwarelivre.org/news/9698), a Microsoft tem financiado a ída as reuni&#245;es de diversas empresas filiadas, de maneira que hoje o OOXML possui, de acordo com recentes sondagens, dois terços dos votos. Isso faria que o Brasil, assim como outros países (EUA, Portugal, Dinamarca), vote a favor do OOXML na ISO.</p>
<p>O que podemos fazer? Até o dia 7 de agosto é possível se inscrever para participar das reuni&#245;es, basta realizar os seguintes passos:</p>
<p>- Enviar e-mail para  solicitando inscriç&#227;o no Comit&#234; (Subcomité Espelho da ISO/IEC CB-21/SC-34).<br />
- Obter um ofício da empresa a quel irá representar indicando que é o representante para assuntos do comit&#234;, e apresentá-lo nas reuni&#245;es.<br />
- Comparecer as duas próximas reuni&#245;es. </p></blockquote>
