---
layout: post
title: A escolha do sistema operacional para a infraestrutura
date: 2007-05-01 11:46:39.000000000 +00:00
type: post
parent_id: '0'
published: true
password: ''
status: publish
categories:
- blog
tags: []
meta:
  _publicize_pending: '1'
  _import_session_id: 5f47b4106fdc1
  _import_original_post_id: '205'
permalink: "/2007/05/01/a-escolha-do-sistema-operacional-para-a-infraestrutura/"
---
<p> O GNU/LINUX foi <a href="http://groups.google.com.br/group/comp.os.minix/msg/5746fce2785c5444?dmode=source&amp;hl=pt-BR">criado</a> há mais de uma década <em>(em breve estaremos completando duas)</em> e mesmo assim muitas pessoas acham que este sistema é para nerds ou ent&#227;o para malucos e adolescentes fanáticos por computaç&#227;o.</p>
<p>Realmente, quando o GNU/LINUX foi lançado ele era um sistema voltado para <strong>"especialistas"</strong>, porém o tempo passou e a idéia de um <em>simples</em> universitário ganhou dimens&#245;es mundiais. Essas dimens&#245;es atravessaram fronteiras e muitas barreiras foram quebradas! Com isso grandes empresas, tais como: IBM, HP, DELL entre outras começaram a adotar este sistema.</p>
<p>Mas mesmo com a adoç&#227;o do sistema por diversas empresas ao redor do mundo, muitas pessoas, incluindo gerentes de TI e CIO's, ainda dizem:</p>
<blockquote><p>  GNU/LINUX é difícil e n&#227;o posso ficar dependente de um único funcionário que conhece essa ferramenta na empresa.</p></blockquote>
<p>Porém quando essa frase é dita, eles esquecem que n&#227;o é somente o GNU/LINUX que é preciso de conhecimento para a sua administraç&#227;o pessoas que pensam dessa maneira s&#227;o &#224;quelas que acreditam que utilizar Microsoft Windows é realmente fácil. Até acredito que esse sistema seja fácil de utilizar, porém é tanto quanto trabalhoso e difícil de administrar <strong>seguramente</strong>. Para muitos segurança é desnecessário, só que pessoas que pensam dessa forma n&#227;o divulgam sua senha do cart&#227;o bancário!</p>
<p>A administraç&#227;o de qualquer sistema n&#227;o é brincadeira! E a escolha do sistema n&#227;o pode levar em consideraç&#227;o apenas o fato da facilidade de utilizaç&#227;o do sistema <strong>A</strong> em relaç&#227;o ao sistema <strong>B</strong>. Isso é realmente uma tremenda <em>idiotice</em>. Utilizar um sistema qualquer pessoa com pouquíssimas qualificaç&#245;es pode fazer. Agora administrar um sistema, é necessário profissional qualificado e isso vale para qualquer sistema.</p>
<p>Com relaç&#227;o &#224; segurança, é claro que existem sistemas que s&#227;o realmente desenvolvidos para serem seguros e estes s&#227;o superiores em relaç&#227;o a outros contudo n&#227;o adianta dizer que a família BSD é 100% segura se a administraç&#227;o n&#227;o for feita por pessoas qualificadas.</p>
<p>Eu, particularmente tenho receio de colocar um servidor com o sistema Microsft diretamente ligado &#224; internet (com um ip válido) sem antes ter um roteador ou um firewall. Voc&#234; deve estar se perguntando, mas por que?</p>
<blockquote><p>  Simples: n&#227;o acho que um servidor com sistema operacional Microsoft pode ser seguro, mesmo com todos os patchs de segurança aplicados e todas as configuraç&#245;es necessárias feitas para que a segurança seja a máxima.</p></blockquote>
<p>É claro que qualquer sistema bem configurado possui menos <strong>vulnerabilidades</strong>. Percebe que a palavra vulnerabilidade diminui quando é precedida por outras duas: <strong>bem configurado</strong>. Isso ocorre com uma máquina com GNU/LINUX ou BSD, uma péssima configuraç&#227;o pode acarretar danos.</p>
<p>Para concluir, gerentes de TI e CIO's n&#227;o escolham um sistema para a sua infraestrutura sistema fáceis de serem utilizados, escolham sistemas eficientes e seguros. A produtividade com sistemas seguros é maior, assim como a estabilidade e a satisfaç&#227;o de quem o administra.</p>
