---
layout: post
title: Are you HANDS ON?
date: 2007-10-25 06:27:26.000000000 +00:00
type: post
parent_id: '0'
published: true
password: ''
status: publish
categories:
- blog
tags: []
meta:
  _publicize_pending: '1'
  _import_session_id: 5f47b4106fdc1
  _import_original_post_id: '255'
permalink: "/2007/10/25/are-you-hands-on/"
---
<p>Vi um anúncio de emprego. A vaga era de gestor de atendimento interno, nome que agora se dá &#224; seç&#227;o de serviços  gerais. E a empresa contratante exigia que os eventuais interessados  possuíssem - sem contar a formaç&#227;o superior, iderança, criatividade, energia, ambiç&#227;o, conhecimentos de informática, flu&#234;ncia em ingl&#234;s e n&#227;o bastasse tudo  isso, ainda fossem hands on. Para o felizardo que conseguisse convencer o entrevistador de que possuía mesmo essa variada gama de habilidades, o salário era um assombro: 800 reais.</p>
<p>Ou seja, um pitico. N&#227;o que esse fosse algum exemplo absolutamente fora da realidade. Pelo contrário, ele é quase o paradigma dos anúncios de emprego atuais. A abundância de candidatos está permitindo que as empresas levantem, cada vez mais, a altura da barra que o postulante terá de saltar para ser admitido. E muitos, de fato, saltam. E se empolgam. E aí v&#234;m as agruras da super-qualificaç&#227;o, que é uma espécie do lado avesso do efeito pitico...</p>
<p>Vamos supor que, após uma duríssima competiç&#227;o com outros candidatos t&#227;o bem preparados quanto ela, a Fabiana conseguisse ser admitida como gestora de atendimento interno. E um de seus primeiros clientes fosse o seu Borges, gerente da contabilidade:</p>
<blockquote><p>- Fabiana, eu quero tr&#234;s cópias deste relatório.<br />
- In a hurry!<br />
- Saúde.<br />
- N&#227;o, isso quer dizer "bem rapidinho". É que eu tenho flu&#234;ncia em ingl&#234;s. Aliás, desculpe perguntar, mas por que a empresa exige flu&#234;ncia em ingl&#234;s se aqui só se fala portugu&#234;s?<br />
- E eu sei lá? Dá para voc&#234; tirar logo as cópias?<br />
- O senhor n&#227;o prefere que eu digitalize o relatório? Porque eu tenho profundos conhecimentos de informática.<br />
- N&#227;o, n&#227;o. Cópias normais mesmo.<br />
- Certo. Mas eu n&#227;o poderia deixar de mencionar minha criatividade. Eu já comecei a desenvolver um projeto pessoal visando eliminar 30% das  cópias que tiramos.<br />
- Fabiana, desse jeito n&#227;o vai dar!<br />
- E eu n&#227;o sei? Preciso urgentemente de uma auxiliar.<br />
- Como assim?<br />
- É que eu sou líder, e n&#227;o tenho ninguém para liderar. E considero isso um desperdício do  meu potencial energético.<br />
- Olha, neste momento, eu só preciso das tr&#234;s có....<br />
- Com certeza. Mas antes vamos discutir meu futuro...<br />
- Futuro?  Que futuro?<br />
- É que eu sou ambiciosa. Já faz dois dias que eu estou aqui e ainda n&#227;o aconteceu nada.O senhor é hands on?<br />
- H&#227;?<br />
- Hands on. M&#227;o na massa.<br />
- Claro que sou!<br />
- Ent&#227;o o senhor mesmo tira as cópias. E agora com licença que eu vou sair por aí explorando minhas potencialidades. Foi o que me prometeram quando eu fui contratada.</p></blockquote>
<p>Ent&#227;o, o mercado de trabalho está ficando dividido em duas facç&#245;es:</p>
<ol>
<li>Uma, cada vez maior, é a dos que n&#227;o conseguem boas vagas porque n&#227;o t&#234;m as qualificaç&#245;es  requeridas.</li>
<li>E o outro grupo, pequeno, mas crescente, é o dos que s&#227;o  admitidos porque possuem todas as compet&#234;ncias exigidas nos anúncios, mas n&#227;o poder&#227;o usar nem metade delas, porque, no fundo, a funç&#227;o n&#227;o precisava delas.</li>
</ol>
<p>Alguém ponderará - com justa raz&#227;o - que a empresa está de olho no longo prazo: sendo portador de tantos talentos, o funcionário poderá ir sendo preparado para assumir responsabilidades cada vez maiores.</p>
<p>Em uma empresa em que trabalhei, nós caímos nessa armadilha. Admitimos um mont&#227;o de  gente superqualificada. E as conversas ficaram de t&#227;o alto nível que um visitante desavisado que chegasse de repente confundiria nossa salinha do café  com o auditório da Fundaç&#227;o Alfred Nobel.</p>
<p>Pessoas superqualificadas n&#227;o resolvem simples problemas!</p>
<blockquote><p>Um dia um grupo de marketing e finanças foi visitar uma de nossas fábricas e no meio da estrada, a van da empresa pifou. Como isso foi antes do advento do milagre do celular, o jeito era confiar no especialista, o Cleto,<br />
motorista da van. E aí todos descobriram que o Cleto falava ingl&#234;s, tinha noç&#245;es e informática e possuía energia e criatividade.  Sem mencionar que estava fazendo pós-graduaç&#227;o. Só que n&#227;o sabia nem abrir o capô.</p>
<p>Duas horas depois, quando o pessoal ainda estava tentando destrinchar o manual do proprietário, passou um sujeito de bicicleta. Para horror de todos, ele falava "nóis vai" e coisas do g&#234;nero. Mas, em 2 minutos, para<br />
espanto geral, botou a van para funcionar. Deram-lhe uns trocados, e ele foi embora feliz da vida. Aquele ciclista anônimo era o protótipo do funcionário para quem as empresas modernas torcem o nariz:</p>
<p>"O que é capaz de resolver, mas n&#227;o de impressionar".</p></blockquote>
<p>"A grandeza de uma naç&#227;o e o seu progresso moral podem ser avaliados pela forma como tratam seus animais." - Ghandi</p>
<p>"Se colorir n&#227;o imprima. Se imprimir seja consciente! Vamos ajudar a preservar o meio ambiente e os recursos da empresa."</p>
<p align="right"><em>Texto recebido por e-mail, autor desconhecido</em></p>
