---
layout: post
title: O Linux está pronto para o Desktop?
date: 2008-08-03 17:58:17.000000000 +00:00
type: post
parent_id: '0'
published: true
password: ''
status: publish
categories:
- blog
- slackware
tags: []
meta:
  _publicize_pending: '1'
  _import_session_id: 5f47b4106fdc1
  _import_original_post_id: '314'
permalink: "/2008/08/03/o-linux-esta-pronto-para-o-desktop/"
---
<p>Basta fazer uma <a title="Busca no Google" href="http://www.google.com.br/search?sourceid=navclient&amp;hl=pt-BR&amp;ie=UTF-8&amp;rlz=1T4ADBF_pt-BRBR253BR253&amp;q=linux+para+o+desktop" target="_blank" rel="noopener noreferrer">simples consulta no google</a>, que voc&ecirc; irá encontrar uma série de sites com matérias, sobre o Linux no Desktop. Encontrará também, vários artigos de inúmeras distribuiç&otilde;es que prometem deixar o Desktop com um Visual 3D e com vários recursos.</p>
<p>Pois bem, n&atilde;o sou contra o Desktop 3D, muito menos com a popularizaç&atilde;o do Linux para o Deskop, porém, as distribuiç&otilde;es que se prop&otilde;em a fazer do Linux um ambiente capaz de ser utilizdo por usuários leigos, falham em muitos aspectos.</p>
<p>Eu mesmo, já comprei um computador com Linux pré-instalado, nele veio uma distribuiç&atilde;o baseada no <a title="Debian" href="http://www.debian.org/">Debian</a>, com o ambiente gráfico baseado no <a title="gnome" href="http://www.gnome.org/" target="_self" rel="noopener noreferrer">Gnome</a>.</p>
<p>Para esse exemplo, segue dois pontos fracos que verifiquei:</p>
<ol>
<li>O computador veio com vários jogos (isso para um usuário comum é algo interessante), porém 50% desses jogos necessitam de placas de vídeo 3D, característica essa que o equipamento n&atilde;o possui, logo paira no ar uma espécie de desgosto, por parte do usuário.</li>
<li>Algumas partes do Sistema estava em ingl&ecirc;s e outras partes em portugu&ecirc;s.</li>
</ol>
<p>Esses, pontos s&atilde;o fortes demais para o usuáio final, com pouca experi&ecirc;ncia em computador.</p>
<p>Bom, voc&ecirc; pode dizer que esses dois pontos s&atilde;o particularidades dessa distribuiç&atilde;o, ok! Posso até concordo, mas...</p>
<p>Agora ent&atilde;o, vou falar de distribuiç&otilde;es com um certo passado (recente), porém com grandes investimentos, algumas até s&atilde;o compradas por grandes companias por milh&otilde;es de dólares, mas possuem características que precisam de conhecimento para operacionalizar o sistema.</p>
<p>Vou tentar exemplificar o que estou querendo dizer...Todos sabem, e para quem n&atilde;o sabe, sou usuário de Linux há 9 anos e há 5 anos utilizo a distribuiç&atilde;o <a title="Slackware" href="http://www.slackware.com" target="_self" rel="noopener noreferrer">Slackware</a>.</p>
<p>O Slackware n&atilde;o é uma distribuiç&atilde;o muito utilizada no mundo corporativo, n&atilde;o entendo o porqu&ecirc;, pois a sua estabilidade é 100%, acredito que o fato de n&atilde;o ser muito bem aceita é pelo fato de ser simples e se aproximar do estilo <a title="bsd" href="http://www.bsd.org/" target="_self" rel="noopener noreferrer">BSD</a> e do <a title="lsb" href="http://www.linuxfoundation.org/en/LSB" target="_self" rel="noopener noreferrer">LSB</a>. Além disso, tem o fato de n&atilde;o existi uma empresa <span style="text-decoration:line-through;"><strong>GRANDE</strong></span>, por trás da distribuiç&atilde;o.</p>
<p>Por essas e outra raz&otilde;es, as empresas escolhem outras distribuiç&otilde;es (<strong><span style="color:#ff0000;">R</span></strong>/<strong><span style="color:#0000ff;">M</span></strong>/<strong><span style="color:#008000;">S</span></strong>). Com o lançameno de uma nova vers&atilde;o dessa distribuiç&atilde;o, resolvi realizar alguns testes, pois ela será o padr&atilde;o adotada pela empresa.</p>
<p>Para isso, baixa-se o CD, grava o ISO no CD, faço o boot na máquina e logo a instalaç&atilde;o é iniciada. Pouco tempo depois a instalaç&atilde;o é finalizada, porém, preciso de mais alguns programas que sr&atilde;o instalados a partir da Internet. Programas instalados, sem executar um único <em>./configure &amp;&amp; make &amp;&amp; make install</em>.</p>
<p>Se voc&ecirc; analisar os passos do parágrafo anterior, tudo OK e relativamente simples para um usuário com pouca experi&ecirc;ncia em informática.</p>
<p>Mas o problema vem logo a seguir....</p>
<p>Após alguns dias utilizando o equipamento, recebo uma mensagem no canto inferior direito da tela, informando que é necessário realizar algumas atualizaç&otilde;es. Para isso vou até o programa de atualizaç&atilde;o e logo verifico algumas atualizaç&otilde;es, dentre elas atualizaç&otilde;es de kernel.</p>
<p>Simplesmente realizo os passos necessário, seleciono os paotes e solicito fazer o upgrade dos mesmos.</p>
<p>Após, alguns minutos a atualizaç&atilde;o foi realizada, e solicita que seja realizado o boot do equipamento. Após o boot, aparece simplesmente a única mensagem que qualquer administrador de sistema n&atilde;o gosta de ver: <strong>KERNEL PANIC!!!</strong></p>
<p>Imagina o usuário comum, lendo essa mensagem e sem o seu sistema funcional!!!</p>
<p>Se a distribuiç&atilde;o, prov&ecirc; ferramentas de atualizaç&otilde;es de programas/kernel, essa ferramenta deve no mínimo realizar a tarefa de forma funcional, se for atualizar o kernel, atualize-o de forma correta. Caso contrário, n&atilde;o adiante prov&ecirc;r ferrmentas que causam transtornos.</p>
<p>Por esse motivo afirmo que do jeito que as distribuiç&otilde;es/empresas fazem de forma capitalista, acabam apenas prejudicando a imagem do Linux e de outras distribuiç&otilde;es sérias.</p>
<p>Linux n&atilde;o é um sistema fácil de ser operado, ele foi e é feito por programadores para programadores, n&atilde;o por empresas capitalistas &agrave; procura de leigos e procurando oportunidade de crescimento.</p>
