---
layout: post
title: Modernidade...
date: 2009-01-31 13:30:23.000000000 +00:00
type: post
parent_id: '0'
published: true
password: ''
status: publish
categories:
- blog
tags: []
meta:
  _publicize_pending: '1'
  _import_session_id: 5f47b4106fdc1
  _import_original_post_id: '534'
permalink: "/2009/01/31/modernidade/"
---
<p style="text-align:center;"><strong><span style="text-decoration:underline;">SABE PORQUE VOC&#202; ESTA DOIDO?</span></strong></p>
<p>VOC&#202; SABE QUE ESTÁ VIVENDO NO SÉCULO XXI QUANDO...</p>
<ol>
<li>Voc&#234; envia e-mail ou msn para conversar com a pessoa que trabalha na mesa ao lado da sua.</li>
<li>Voc&#234; usa o celular na garagem de casa para pedir a alguém que o ajude a desembarcar as compras.</li>
<li>Esquecendo seu celular em casa, coisa que voc&#234; n&#227;o tinha há 20 anos, voc&#234; fica apavorado e volta buscá-lo.</li>
<li>Voc&#234; levanta pela manh&#227; e quase que liga o computador antes de tomar o café.</li>
<li>Voc&#234; conhece o significado de naum, tbm, qdo, xau, msm, dps ...</li>
<li>Voc&#234; n&#227;o sabe o preço de um envelope comum;</li>
<li>A maioria das piadas que voc&#234; conhece, voc&#234; recebeu por e-mail (e ainda por cima ri sozinho...);</li>
<li>Voc&#234; fala o nome da firma onde trabalha quando atende ao telefone em sua própria casa (ou até mesmo o celular !!);</li>
<li>Voc&#234; digita o '0' para telefonar de sua casa;</li>
<li>Voc&#234; vai ao trabalho quando o dia ainda está clareando, volta para casa quando já escureceu de novo;</li>
<li>Quando seu computador pára de funcionar, parece que foi seu coraç&#227;o que parou;</li>
<li>Voc&#234; está lendo esta lista e está concordando com a cabeça e sorrindo.</li>
<li>E AGORA VOC&#202; ESTÁ RINDO CONSIGO MESMO...</li>
<li>Voc&#234; já está pensando para quem voc&#234; vai enviar esta mensagem ..</li>
<li>Provavelmente agora voc&#234; vai clicar no bot&#227;o 'Encaminhar'<br />
... é a vida...fazer o qu&#234;... foi o que eu fiz também...</li>
</ol>
<p>Feliz modernidade!</p>
<p style="text-align:right;"><em>Texto recebido por e-mail, autor desconhecido</em></p>
