---
layout: post
title: Laura não trabalha mais aqui – Ao menos não a sua essência...
date: 2011-02-20 20:22:54.000000000 +00:00
type: post
parent_id: '0'
published: true
password: ''
status: publish
categories:
- blog
tags: []
meta:
  _publicize_pending: '1'
  _import_session_id: 5f47b4106fdc1
  _import_original_post_id: '847'
permalink: "/2011/02/20/laura-nao-trabalha-mais-aqui-ao-menos-nao-a-sua-essencia/"
---
<p>Muita coinci&#234;ncia....recebi um e-mail com o mesmo conteúdo do texto abaixo que foi publicado no site <a href="http://alliancecoaching.wordpress.com/">Alliance Coaching</a>. O texto é uito bom e vale a pena a leitura...</p>
<p>Contratei Laura há um par de anos. Sua bagagem técnica, somada &#224; sua habilidade para fazer as coisas acontecerem, fez dela a escolha ideal para assumir a posiç&#227;o de gerente de projetos na minha equipe.</p>
<p><strong>Mudanças &#224; vista</strong></p>
<p>As coisas mudam. Seis meses mais tarde, a empresa foi reestruturada e minha equipe foi desmantelada e dividida entre várias outras. O time de talento que construí foi incorporado em outras equipes para ajudá-las a crescerem. Laura foi alocada num grupo onde suas habilidades eram realmente demandadas. Ela se encaixou perfeitamente e imediatamente se tornou uma integrante produtiva nesta nova equipe.</p>
<p><strong>E mais mudanças&#8230;</strong></p>
<p>Mais mudanças. Essa nova equipe foi dissolvida. Seu novo chefe foi demitido. Laura foi transferida para um outro time. Desta vez, ela n&#227;o se encaixou t&#227;o bem no grupo. Outros integrantes da equipe tinham as mesmas habilidades dela, portanto o que ela oferecia era mais redundante do que propriamente um talento único. Seu novo chefe a designou para uma tarefa que n&#227;o estava alinhada com o seu perfil. Ela se esforçava sobre a mesma, mas n&#227;o alcançava um desempenho &#224; altura do seu padr&#227;o usual.</p>
<p>Semana passada, eu a vi. Laura estava do outro lado do sagu&#227;o, longe demais para que pudesse falar com ela. Entretanto, sua linguagem corporal falava alto e era muito clara. Sua cabeça estava baixa. Seu sorriso a havia abandonado. Aquela vívida elasticidade sumira de seus movimentos. Mesmo para o nosso estilo casual, suas roupas pareciam pouco profissionais. A mulher talentosa, motivada e vencedora que eu havia contratado havia se transformado numa robô desmotivada.</p>
<p><strong>Sem mudanças</strong></p>
<p>É realmente triste ver a Laura desta forma. Ela é uma boa mulher e estou seguro que se sente mal por n&#227;o ter tido habilidade o suficiente para lidar com a tarefa a qual foi designada. Entretanto, Pablo, é pela nossa empresa que me sinto triste. Eles perderam a funcionária brilhante, comprometida, que dá duro e com compet&#234;ncia de fazer muitas coisas bem acima da média.</p>
<p>Ao invés de utilizar esta funcionária fora-de-série numa posiç&#227;o onde pudesse se superar, a empresa a deslocou para um lugar onde ela fracassou.  Ao invés de realocá-la de volta para sua posiç&#227;o original ou experimentá-la numa nova funç&#227;o, a empresa a deixou onde está e efetivamente acabou rotulando-a como fracassada. N&#227;o tenho duvida alguma que Laura estará em breve numa outra empresa, t&#227;o logo consiga encontrar um posiç&#227;o adequada. Ela vai se dar bem lá. É uma profissional  com grande potencial. Nossa empresa n&#227;o podia se dar o luxo de perder pessoas de talento, mas nós perdemos a Laura&#8230; Por enquanto, nós ainda contamos com a sua presença, mas sua ess&#234;ncia n&#227;o está mais conosco.&#8221;</p>
<p><strong>Lidando com esta quest&#227;o</strong></p>
<p>Imagino que voc&#234; ou vivenciou histórias semelhantes ou ouviu narrativas parecidas&#8230; A liç&#227;o que quero dividir com voc&#234; é simples. Encontre e recrute as melhores pessoas que puder. Coloque-as nos lugares onde elas podem dar o seu melhor e deixe-as fazer o trabalho para o qual foram contratadas. Ajude seu time a ter &#234;xito e sua empresa terá &#234;xito.  É simples&#8230; mas n&#227;o é fácil.</p>
<p style="text-align:right;"><em>Autor desconhecido</em></p>
